/***************************************************************************
midi.c

This is a 7 segment display interface project. Display TS-5261ASR are connected
to port 1 of the MCU at89c51 and counts from 0 to 99 with 1 second delay
***************************************************************************/

#include <mcs51\at89x51.h>

unsigned char sec0=10, sec1=10;

int segmarr[26] = { 0x03, 0x9F, 0x25, 0x0D, 0x99, 0x49, 0x41, 0x1F, 0x01, 0x09, 0xFF, 0xFE,  // 0, 1, 2, ..., 9, <пусто>, <точка> 
0x11, 0xC1, 0x63, 0x85, 0x61, 0x71, 0x43, 0x91, 0xC3, 0x83, 0x73, 0x13, 0x31, 0x89 };  // A, b, C, d, E, F, G, H, L, U, Г, П, Р, У

int flag=0, k;
unsigned char x=0;

//----------------------------------------------------------------------------------
void Timer0_ISR(void) __interrupt (1)
{
  if(flag == 0) {
    P1 = segmarr[sec0]; // 7-сегм.код младшего разряда числа --> P1
	P3_0 = 0;			// dig1 = 0
    P3_1 = 1;			// dig2 = 1  - зажигаем младший разряд дисплея
	flag = 1;
  }
  else { // flag = 1
    P1 = segmarr[sec1];
    P3_0 = 1;			// dig1 = 1  - зажигаем старший разряд дисплея
    P3_1 = 0;			// dig2 = 0
    flag = 0;
  }
  TL0 = 0xEF;	// TH0,TL0 = D8EFh  timer 0 in mode 1 (16 bit)
  TH0 = 0xD8;	//
  return;
}

//----------------------------------------------------------------------------------
void time1ms()  // 1 ms delay with XTAL 12.000 MHz
{
  int i;
  for(i=0; i < 150; i++) // the value 150 was calibrated for 1ms 
    ;					
}

//---------------------------------------------------------------------------------
void delay(int n) // do nothing n*1ms
{
  int i;
  for(i=0; i < n ; i++)
    time1ms();
}

//-------------------------- Main program ---------------------------------
void main(void)
{
  EA = 0;	// Блокировка всех прерываний
  ET0 = 0;  // запрет прерывания по таймеру 0
  P3_0 = 0;		
  P3_1 = 1;		// тестируем младший разряд дисплея
   x = 0x80;		// сегмент_a = 0
  for(k=0; k < 8 ; k++) {
	P1 = ~x;
	delay(100);
	x = x >> 1; // след.сегмент
  }
  P1 = 0xFF;	// <пусто> --> дисплей
  delay(100);
  P3_0 = 1;		// тестируем старший разряд дисплея
  P3_1 = 0;
  x = 0x80;		// сегмент_a = 0
  for(k=0; k < 8 ; k++) {
	P1 = ~x;	// инверсия байта --> P1 (дисплей)
	delay(100);
	x = x >> 1;
  }
  P1 = 0xFF;	// очистить дисплей
  P3_1 = 0;
  P3_0 = 0;
  
  TMOD = 0x01;  // Задание режима работы C/T0
  TL0 = 0xEF;   // Загрузка младшего байта C/T0
  TH0 = 0xD8;   // Загрузка старшего байта C/T0
  EA = 1;       // Снятие общей блокировки прерываний
  ET0 = 1;      // Разрешение прерывания от TF0
  TR0 = 1;      // Пуск таймера C/T0
  while(1) {
	delay(1000);	// delay 1 sec
	if(sec0 < 9) {
	  sec0++;
	}
	else {  // sec0 = 9
	  if(sec1 < 9) {
	    sec1++;
	    sec0 = 0;
	  }
	  else if(sec1 == 9 && sec0 == 9) {
		     sec0 = 0;
		     sec1 = 0;
	  }
	}
  }
}